{
  "<BOS>": 0,
  "<EOS>": 1,
  "KeyA_down": 2,
  "KeyA_up": 3,
  "KeyB_down": 4,
  "KeyB_up": 5,
  "KeyC_down": 6,
  "KeyC_up": 7,
  "KeyD_down": 8,
  "KeyD_up": 9,
  "KeyE_down": 10,
  "KeyE_up": 11,
  "KeyF_down": 12,
  "KeyF_up": 13,
  "KeyG_down": 14,
  "KeyG_up": 15,
  "KeyH_down": 16,
  "KeyH_up": 17,
  "KeyI_down": 18,
  "KeyI_up": 19,
  "KeyJ_down": 20,
  "KeyJ_up": 21,
  "KeyK_down": 22,
  "KeyK_up": 23,
  "KeyL_down": 24,
  "KeyL_up": 25,
  "KeyM_down": 26,
  "KeyM_up": 27,
  "KeyN_down": 28,
  "KeyN_up": 29,
  "KeyO_down": 30,
  "KeyO_up": 31,
  "KeyP_down": 32,
  "KeyP_up": 33,
  "KeyQ_down": 34,
  "KeyQ_up": 35,
  "KeyR_down": 36,
  "KeyR_up": 37,
  "KeyS_down": 38,
  "KeyS_up": 39,
  "KeyT_down": 40,
  "KeyT_up": 41,
  "KeyU_down": 42,
  "KeyU_up": 43,
  "KeyV_down": 44,
  "KeyV_up": 45,
  "KeyW_down": 46,
  "KeyW_up": 47,
  "KeyX_down": 48,
  "KeyX_up": 49,
  "KeyY_down": 50,
  "KeyY_up": 51,
  "KeyZ_down": 52,
  "KeyZ_up": 53,
  "Digit0_down": 54,
  "Digit0_up": 55,
  "Digit1_down": 56,
  "Digit1_up": 57,
  "Digit2_down": 58,
  "Digit2_up": 59,
  "Digit3_down": 60,
  "Digit3_up": 61,
  "Digit4_down": 62,
  "Digit4_up": 63,
  "Digit5_down": 64,
  "Digit5_up": 65,
  "Digit6_down": 66,
  "Digit6_up": 67,
  "Digit7_down": 68,
  "Digit7_up": 69,
  "Digit8_down": 70,
  "Digit8_up": 71,
  "Digit9_down": 72,
  "Digit9_up": 73,
  "Minus_down": 74,
  "Minus_up": 75,
  "Equal_down": 76,
  "Equal_up": 77,
  "BracketLeft_down": 78,
  "BracketLeft_up": 79,
  "BracketRight_down": 80,
  "BracketRight_up": 81,
  "Backslash_down": 82,
  "Backslash_up": 83,
  "Semicolon_down": 84,
  "Semicolon_up": 85,
  "Quote_down": 86,
  "Quote_up": 87,
  "Backquote_down": 88,
  "Backquote_up": 89,
  "Comma_down": 90,
  "Comma_up": 91,
  "Period_down": 92,
  "Period_up": 93,
  "Slash_down": 94,
  "Slash_up": 95,
  "ShiftLeft_down": 96,
  "ShiftLeft_up": 97,
  "ShiftRight_down": 98,
  "ShiftRight_up": 99,
  "ControlLeft_down": 100,
  "ControlLeft_up": 101,
  "ControlRight_down": 102,
  "ControlRight_up": 103,
  "AltLeft_down": 104,
  "AltLeft_up": 105,
  "AltRight_down": 106,
  "AltRight_up": 107,
  "MetaLeft_down": 108,
  "MetaLeft_up": 109,
  "MetaRight_down": 110,
  "MetaRight_up": 111,
  "CapsLock_down": 112,
  "CapsLock_up": 113,
  "Space_down": 114,
  "Space_up": 115,
  "Tab_down": 116,
  "Tab_up": 117,
  "Enter_down": 118,
  "Enter_up": 119,
  "Backspace_down": 120,
  "Backspace_up": 121,
  "Delete_down": 122,
  "Delete_up": 123,
  "ArrowLeft_down": 124,
  "ArrowLeft_up": 125,
  "ArrowRight_down": 126,
  "ArrowRight_up": 127,
  "ArrowUp_down": 128,
  "ArrowUp_up": 129,
  "ArrowDown_down": 130,
  "ArrowDown_up": 131,
  "Home_down": 132,
  "Home_up": 133,
  "End_down": 134,
  "End_up": 135,
  "PageUp_down": 136,
  "PageUp_up": 137,
  "PageDown_down": 138,
  "PageDown_up": 139,
  "Insert_down": 140,
  "Insert_up": 141,
  "Escape_down": 142,
  "Escape_up": 143,
  "F1_down": 144,
  "F1_up": 145,
  "F2_down": 146,
  "F2_up": 147,
  "F3_down": 148,
  "F3_up": 149,
  "F4_down": 150,
  "F4_up": 151,
  "F5_down": 152,
  "F5_up": 153,
  "F6_down": 154,
  "F6_up": 155,
  "F7_down": 156,
  "F7_up": 157,
  "F8_down": 158,
  "F8_up": 159,
  "F9_down": 160,
  "F9_up": 161,
  "F10_down": 162,
  "F10_up": 163,
  "F11_down": 164,
  "F11_up": 165,
  "F12_down": 166,
  "F12_up": 167
}