{
  "added_tokens_decoder": {
    "0": {
      "content": "<BOS>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<EOS>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "bos_token": "<BOS>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<EOS>",
  "extra_special_tokens": {},
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<EOS>",
  "processor_class": "WhisperProcessor",
  "tokenizer_class": "KeyboardEventTokenizer"
}
